In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

- is part of data analysis
- once data is prepared, group statistics is performed
- involves splitting data into pieces 
- then computing statistics like mean, SD...

# split-apply-combine

- data is split first
- function is applied
- then the results are combined

In [ ]:
X = [a,b,c,c,a,b,b,b,a,c,b] groupA = [a,a,a], groupB = [b,b,b,b,b], groupC = [c,c,c] abc = [a,b,c]

In [ ]:
# groupby -

In [2]:
dframe = pd.DataFrame({'key1': ['a','a','b','b','a'],
                       'key2': ['first','second','first','second','first'],
                       'col1': np.random.randn(5),
                       'col2': np.random.randn(5)})

In [3]:
dframe

       col1      col2 key1    key2
0 -1.854730  1.732416    a   first
1 -1.044042 -0.874841    a  second
2  0.146421 -0.133403    b   first
3  0.992461  0.297504    b  second
4  0.514805  0.233272    a   first

In [4]:
group1 = dframe['col1'].groupby(dframe['key1'])

In [5]:
group1

In [6]:
group1.mean()

key1
a   -0.794656
b    0.569441
Name: col1, dtype: float64

In [7]:
names = np.array(['Jane','Tom','Tom', 'Jane','Jane'])
years = np.array([1999, 1999, 1982, 1999, 1982])

In [8]:
dframe['col1'].groupby([names, years]).mean()

Jane  1982    0.514805
      1999   -0.431134
Tom   1982    0.146421
      1999   -1.044042
Name: col1, dtype: float64

In [9]:
dframe.groupby('key1').mean()

          col1      col2
key1
a    -0.794656  0.363616
b     0.569441  0.082051

In [10]:
dframe.groupby(['key1','key2']).mean()

                 col1      col2
key1 key2
a    first  -0.669962  0.982844
     second -1.044042 -0.874841
b    first   0.146421 -0.133403
     second  0.992461  0.297504

# Iteration on groupby objects

In [18]:
dframe

       col1      col2 key1    key2
0 -1.854730  1.732416    a   first
1 -1.044042 -0.874841    a  second
2  0.146421 -0.133403    b   first
3  0.992461  0.297504    b  second
4  0.514805  0.233272    a   first

In [20]:
dframe.groupby(['key1','key2']).mean()

                 col1      col2
key1 key2
a    first  -0.669962  0.982844
     second -1.044042 -0.874841
b    first   0.146421 -0.133403
     second  0.992461  0.297504

In [21]:
group12 = dframe.groupby(['key1','key2'])

In [22]:
group12

In [23]:
group12.mean()

                 col1      col2
key1 key2
a    first  -0.669962  0.982844
     second -1.044042 -0.874841
b    first   0.146421 -0.133403
     second  0.992461  0.297504

In [ ]:
# iteration

In [24]:
for key, data in dframe.groupby('key1'):
    print key
    print data

a
       col1      col2 key1    key2
0 -1.854730  1.732416    a   first
1 -1.044042 -0.874841    a  second
4  0.514805  0.233272    a   first
b
       col1      col2 key1    key2
2  0.146421 -0.133403    b   first
3  0.992461  0.297504    b  second

In [25]:
for key, data in dframe.groupby('key2'):
    print key
    print data

first
       col1      col2 key1   key2
0 -1.854730  1.732416    a  first
2  0.146421 -0.133403    b  first
4  0.514805  0.233272    a  first
second
       col1      col2 key1    key2
1 -1.044042 -0.874841    a  second
3  0.992461  0.297504    b  second

In [26]:
for (key1, key2), data in dframe.groupby(['key1', 'key2']):
    print key1, key2
    print data

a first
       col1      col2 key1   key2
0 -1.854730  1.732416    a  first
4  0.514805  0.233272    a  first
a second
       col1      col2 key1    key2
1 -1.044042 -0.874841    a  second
b first
       col1      col2 key1   key2
2  0.146421 -0.133403    b  first
b second
       col1      col2 key1    key2
3  0.992461  0.297504    b  second

# Grouping Objects with dictionaries and series

In [27]:
people_names = pd.DataFrame(np.random.randn(5,5),
                           columns=['a','b','c','d','e'],
                           index=['Joe','James','Tim','Lin','Hector'])

In [28]:
people_names

               a         b         c         d         e
Joe     1.586150 -1.770857  0.367207  0.066884  0.395955
James   0.042035  0.253308 -1.898763  2.990182 -1.594011
Tim    -1.023072  0.694232 -0.412666  0.925398 -1.336107
Lin     0.884031  0.281920  1.108264 -0.823106  0.704517
Hector  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [31]:
people_names.loc[2:3, ['b','d']] = np.nan

In [32]:
people_names

               a         b         c         d         e
Joe     1.586150 -1.770857  0.367207  0.066884  0.395955
James   0.042035  0.253308 -1.898763  2.990182 -1.594011
Tim    -1.023072       NaN -0.412666       NaN -1.336107
Lin     0.884031  0.281920  1.108264 -0.823106  0.704517
Hector  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [33]:
map_dict = {'a': 'three', 'b':'three', 'c':'four', 'd':'four', 'e':'three'}

In [34]:
group_dict = people_names.groupby(map_dict, axis=1)

In [35]:
group_dict

In [36]:
group_dict.mean()

            four     three
Joe     0.217046  0.070416
James   0.545710 -0.432890
Tim    -0.412666 -1.179590
Lin     0.142579  0.623489
Hector  0.208744  0.072802

In [37]:
group_dict.sum()

            four     three
Joe     0.434091  0.211248
James   1.091419 -1.298669
Tim    -0.412666 -2.359179
Lin     0.285159  1.870467
Hector  0.417487  0.218406

In [38]:
map_ser = pd.Series(map_dict)

In [39]:
map_ser

a    three
b    three
c     four
d     four
e    three
dtype: object

In [40]:
people_names

               a         b         c         d         e
Joe     1.586150 -1.770857  0.367207  0.066884  0.395955
James   0.042035  0.253308 -1.898763  2.990182 -1.594011
Tim    -1.023072       NaN -0.412666       NaN -1.336107
Lin     0.884031  0.281920  1.108264 -0.823106  0.704517
Hector  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [41]:
group_ser = people_names.groupby(map_ser, axis=1)

In [42]:
group_ser

In [43]:
group_ser.mean()

            four     three
Joe     0.217046  0.070416
James   0.545710 -0.432890
Tim    -0.412666 -1.179590
Lin     0.142579  0.623489
Hector  0.208744  0.072802

In [44]:
group_ser.sum()

            four     three
Joe     0.434091  0.211248
James   1.091419 -1.298669
Tim    -0.412666 -2.359179
Lin     0.285159  1.870467
Hector  0.417487  0.218406

In [45]:
group_ser.count()

        four  three
Joe        2      3
James      2      3
Tim        1      2
Lin        2      3
Hector     2      3

# Grouping Objects with functions and index

In [48]:
people_names

               a         b         c         d         e
Joe     1.586150 -1.770857  0.367207  0.066884  0.395955
James   0.042035  0.253308 -1.898763  2.990182 -1.594011
Tim    -1.023072       NaN -0.412666       NaN -1.336107
Lin     0.884031  0.281920  1.108264 -0.823106  0.704517
Hector  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [ ]:
# len = 3, 5, 6

In [50]:
name_len = people_names.groupby(len)

In [51]:
name_len

In [52]:
name_len.mean()

          a         b         c         d         e
3  0.482369 -0.744469  0.354269 -0.378111 -0.078545
5  0.042035  0.253308 -1.898763  2.990182 -1.594011
6  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [53]:
name_len.sum()

          a         b         c         d         e
3  1.447108 -1.488937  1.062806 -0.756222 -0.235635
5  0.042035  0.253308 -1.898763  2.990182 -1.594011
6  1.098101 -0.895507 -0.772170  1.189658  0.015812

In [54]:
name_len.count()

   a  b  c  d  e
3  3  2  3  2  3
5  1  1  1  1  1
6  1  1  1  1  1

In [56]:
columns = pd.MultiIndex.from_arrays([['A','A','A','B','B'],[2,4,6,2,4]], names=['alp','num'])

In [57]:
dframe1 = pd.DataFrame(np.random.randn(4,5), columns=columns)

In [58]:
dframe1

alp         A                             B
num         2         4         6         2         4
0   -0.062867 -0.842107 -0.199755  1.525476  1.365956
1    0.233205  1.663745 -0.940526  0.911650 -0.508407
2    2.213850  0.266054  0.596071 -0.298981 -0.773683
3   -0.990733 -0.285358 -1.899715  0.991040  1.366418

In [60]:
group_index = dframe1.groupby(level='alp', axis=1)

In [61]:
group_index.count()

alp  A  B
0    3  2
1    3  2
2    3  2
3    3  2

In [62]:
group_index.sum()

alp         A         B
0   -1.104729  2.891433
1    0.956424  0.403242
2    3.075975 -1.072664
3   -3.175806  2.357458

In [63]:
group_index.mean()

alp         A         B
0   -0.368243  1.445716
1    0.318808  0.201621
2    1.025325 -0.536332
3   -1.058602  1.178729

# The aggregate method - agg( )

In [ ]:
# aggr - we transform our data using mean, sum etc... the end result is a scalar value

In [64]:
dframe = pd.DataFrame({'key1': ['a','a','b','b','a'],
                       'key2': ['first','second','first','second','first'],
                       'col1': np.random.randn(5),
                       'col2': np.random.randn(5)})

In [65]:
dframe

       col1      col2 key1    key2
0 -1.400404 -0.388472    a   first
1  2.256898 -0.493253    a  second
2  1.259004  1.169112    b   first
3  1.129495  0.715531    b  second
4  0.161089  0.322861    a   first

In [66]:
group_key1 = dframe.groupby('key1')

In [67]:
group_key1

In [68]:
group_key1.mean()

          col1      col2
key1
a     0.339194 -0.186288
b     1.194249  0.942321

In [69]:
group_key1.describe()

                col1      col2
key1
a    count  3.000000  3.000000
     mean   0.339194 -0.186288
     std    1.835144  0.444038
     min   -1.400404 -0.493253
     25%   -0.619658 -0.440863
     50%    0.161089 -0.388472
     75%    1.208993 -0.032806
     max    2.256898  0.322861
b    count  2.000000  2.000000
     mean   1.194249  0.942321
     std    0.091577  0.320731
     min    1.129495  0.715531
     25%    1.161872  0.828926
     50%    1.194249  0.942321
     75%    1.226626  1.055717
     max    1.259004  1.169112

In [ ]:
# agg

In [70]:
def max_to_mean(x):
    return x.max() - x.mean()

In [71]:
group_key1.agg(max_to_mean)

          col1      col2
key1
a     1.917704  0.509149
b     0.064755  0.226791

In [ ]:
# Bryant & Smith Business Statistics

In [ ]:
# tips.csv

In [72]:
tips = pd.read_csv('tips.csv')

In [73]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [75]:
tips['pct_tips'] = tips['tip']/ tips['total_bill']

In [77]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  pct_tips
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [78]:
tips_group = tips.groupby(['sex','smoker'])

In [79]:
tips_group

In [80]:
tips_group.agg('mean')

               total_bill       tip      size  pct_tips
sex    smoker
Female No       18.105185  2.773519  2.592593  0.156921
       Yes      17.977879  2.931515  2.242424  0.182150
Male   No       19.791237  3.113402  2.711340  0.160669
       Yes      22.284500  3.051167  2.500000  0.152771

In [81]:
tips_group.agg('max')

               total_bill   tip   day   time  size  pct_tips
sex    smoker
Female No           35.83   5.2  Thur  Lunch     6  0.252672
       Yes          44.30   6.5  Thur  Lunch     4  0.416667
Male   No           48.33   9.0  Thur  Lunch     6  0.291990
       Yes          50.81  10.0  Thur  Lunch     5  0.710345

In [86]:
tips_group.agg(['mean','max', max_to_mean])

              total_bill                          tip                    \
                    mean    max max_to_mean      mean   max max_to_mean
sex    smoker
Female No      18.105185  35.83   17.724815  2.773519   5.2    2.426481
       Yes     17.977879  44.30   26.322121  2.931515   6.5    3.568485
Male   No      19.791237  48.33   28.538763  3.113402   9.0    5.886598
       Yes     22.284500  50.81   28.525500  3.051167  10.0    6.948833

                   size                  pct_tips
                   mean max max_to_mean      mean       max max_to_mean
sex    smoker
Female No      2.592593   6    3.407407  0.156921  0.252672    0.095752
       Yes     2.242424   4    1.757576  0.182150  0.416667    0.234516
Male   No      2.711340   6    3.288660  0.160669  0.291990    0.131321
       Yes     2.500000   5    2.500000  0.152771  0.710345    0.557574

In [87]:
xx = tips_group.agg(['mean','max', max_to_mean])

In [88]:
xx['pct_tips']

                   mean       max  max_to_mean
sex    smoker
Female No      0.156921  0.252672     0.095752
       Yes     0.182150  0.416667     0.234516
Male   No      0.160669  0.291990     0.131321
       Yes     0.152771  0.710345     0.557574

In [ ]:
# column

In [89]:
dframe

       col1      col2 key1    key2
0 -1.400404 -0.388472    a   first
1  2.256898 -0.493253    a  second
2  1.259004  1.169112    b   first
3  1.129495  0.715531    b  second
4  0.161089  0.322861    a   first

In [90]:
mean_col = dframe.groupby('key2').mean().add_prefix('mean_of_')

In [91]:
mean_col

        mean_of_col1  mean_of_col2
key2
first       0.006563      0.367834
second      1.693196      0.111139

In [92]:
pd.merge(dframe, mean_col, left_on = 'key2', right_index=True)

       col1      col2 key1    key2  mean_of_col1  mean_of_col2
0 -1.400404 -0.388472    a   first      0.006563      0.367834
2  1.259004  1.169112    b   first      0.006563      0.367834
4  0.161089  0.322861    a   first      0.006563      0.367834
1  2.256898 -0.493253    a  second      1.693196      0.111139
3  1.129495  0.715531    b  second      1.693196      0.111139

In [93]:
dframe

       col1      col2 key1    key2
0 -1.400404 -0.388472    a   first
1  2.256898 -0.493253    a  second
2  1.259004  1.169112    b   first
3  1.129495  0.715531    b  second
4  0.161089  0.322861    a   first

In [94]:
new_mean_col = dframe.groupby('key1').mean().add_prefix('mean_for_')

In [95]:
new_mean_col

      mean_for_col1  mean_for_col2
key1
a          0.339194      -0.186288
b          1.194249       0.942321

In [96]:
pd.merge(dframe, new_mean_col, left_on = 'key1', right_index=True)

       col1      col2 key1    key2  mean_for_col1  mean_for_col2
0 -1.400404 -0.388472    a   first       0.339194      -0.186288
1  2.256898 -0.493253    a  second       0.339194      -0.186288
4  0.161089  0.322861    a   first       0.339194      -0.186288
2  1.259004  1.169112    b   first       1.194249       0.942321
3  1.129495  0.715531    b  second       1.194249       0.942321